In [2]:
import pandas as pd
import numpy as np
import seaborn as sns
import matplotlib.pyplot as plt
sns.set_style('darkgrid', {'legend.frameon':True})

In [3]:
df = pd.read_csv('csv/geo.csv', encoding = 'utf-8')

In [4]:
df.head()

,url,nat,cap
0,/titanic-survivor/elisabeth-walton-allen.html,American,"Washington, D.C."
1,/titanic-survivor/harry-anderson.html,American,"Washington, D.C."
2,/titanic-survivor/kornelia-theodosia-andrews.html,American,"Washington, D.C."
3,/titanic-survivor/charlotte-appleton.html,American,"Washington, D.C."
4,/titanic-survivor/madeleine-talmage-astor.html,American,"Washington, D.C."

In [5]:
df['nat'].value_counts()

English             320
American            259
Irish               126
Swedish             112
Syrian               86
Finnish              60
Canadian             36
French               32
Croatian             30
Norwegian            29
Bulgarian            26
Welsh                18
Scottish             17
Swiss                17
Russian              15
Channel Islander     15
Belgian              15
Danish               10
German               10
Italian               9
Spanish               9
Austrian              8
Chinese               8
Polish                7
Turkish               6
Slovenian             4
South African         4
Greek                 4
Portuguese            4
Bosnian               4
Uruguayan             3
Lithuanian            2
Australian            2
Hungarian             1
Siamese               1
Argentinian           1
Japanese              1
Latvian               1
Mexican               1
Macedonian            1
Czech                 1
Egyptian              1
Dutch                 1
Name: nat, dtype: int64

In [6]:
capitals = {
    'English':'London',
    'American':'Washington, D.C.',
    'Irish':'Dublin',
    'Swedish':'Stockholm',
    'Syrian':'Damascus',
    'Finnish':'Helsinki',
    'Canadian':'Ottawa',
    'French':'Paris',
    'Croatian':'Zagreb',
    'Norwegian':'Oslo',
    'Bulgarian':'Sofia',
    'Welsh':'Cardiff',
    'Scottish':'Edinburgh',
    'Swiss':'Bern',
    'Channel Islander':'Saint Peter Port',
    'Belgian':'Brussels',
    'Russian':'Moscow',
    'Danish':'Copenhagen',
    'German':'Berlin',
    'Spanish':'Madrid',
    'Italian':'Rome',
    'Austrian':'Vienna',
    'Chinese':'Beijing',
    'Polish':'Warsaw',
    'Turkish':'Ankara',
    'Greek':'Athens',
    'Slovenian':'Ljubljana',
    'South African':'Pretoria',
    'Bosnian':'Sarajevo',
    'Portuguese':'Lisbon',
    'Uruguayan':'Montevideo',
    'Lithuanian':'Vilnius',
    'Australian':'Canberra',
    'Latvian':'Riga',
    'Siamese':'Bangkok',
    'Dutch':'Amsterdam',
    'Egyptian':'Cairo',
    'Hungarian':'Budapest',
    'Argentinian':'Buenos Aires',
    'Mexican':'Mexico City',
    'Czech':'Prague',
    'Macedonian':'Skopje',
    'Japanese':'Tokyo'
}

In [7]:
df['cap'] = df['nat'].apply(lambda x: capitals[x])

In [8]:
df.head()

,url,nat,cap
0,/titanic-survivor/elisabeth-walton-allen.html,American,"Washington, D.C."
1,/titanic-survivor/harry-anderson.html,American,"Washington, D.C."
2,/titanic-survivor/kornelia-theodosia-andrews.html,American,"Washington, D.C."
3,/titanic-survivor/charlotte-appleton.html,American,"Washington, D.C."
4,/titanic-survivor/madeleine-talmage-astor.html,American,"Washington, D.C."

In [9]:
df.to_csv('csv/geo.csv', index=False, encoding='utf-8')

In [10]:
df[df['nat'] == 'Japanese']

                                        url       nat    cap
979  /titanic-survivor/masabumi-hosono.html  Japanese  Tokyo